# Данные о переменных
class Constants:
    VARIABLES_DESCRIPTION = {
        '1': {
            'variable_title': 'L1 Общее количество ДТП в РФ (в год)',
            'variable_name': 'L1 (Общее количество ДТП в РФ (в год))',
        },
        '2': {
            'variable_title': 'L2 Количество погибших в ДТП',
            'variable_name': 'L2 (Количество погибших в ДТП)',
        },
        '3': {
            'variable_title': 'L3 Количество раненых в ДТП',
            'variable_name': 'L3 (Количество раненых в ДТП)',
        },
        '4': {
            'variable_title': 'L4 Тяжесть последствий ДТП (кол-во погибших на 100 пострадавших)',
            'variable_name': 'L4 (Тяжесть последствий ДТП (кол-во погибших на 100 пострадавших))',
        },
        '5': {
            'variable_title': 'L5 Количество погибших на 10 000 транспортных средств',
            'variable_name': 'L5 (Количество погибших на 10 000 транспортных средств)',
        },
        '6': {
            'variable_title': 'L6 Количество пострадавших на 100000 жителей',
            'variable_name': 'L6 (Количество пострадавших на 100000 жителей)',
        },
        '7': {
            'variable_title': 'L7 Количество ДТП из-за нарушения ПДД водителями',
            'variable_name': 'L7 (Количество ДТП из-за нарушения ПДД водителями)',
        },
        '8': {
            'variable_title': 'L8 Количество ДТП по вине нетрезвых водителей',
            'variable_name': 'L8 (Количество ДТП по вине нетрезвых водителей)',
        },
        '9': {
            'variable_title': 'L9 Количество ДТП по вине пешеходов',
            'variable_name': 'L9 (Количество ДТП по вине пешеходов)',
        },
        '10': {
            'variable_title': 'L10 Количество ДТП с участием детей',
            'variable_name': 'L10 (Количество ДТП с участием детей)',
        },
        '11': {
            'variable_title': 'L11 Количество ДТП по вине технически неисправных транспортных средств',
            'variable_name': 'L11 (Количество ДТП по вине технически неисправных транспортных средств)',
        },
        '12': {
            'variable_title': 'L12 Количество ДТП из-за неудовлетворительного состояния улиц и дорог',
            'variable_name': 'L12 (Количество ДТП из-за неудовлетворительного состояния улиц и дорог)',
        },
        '13': {
            'variable_title': 'L13 Количество ДТП с тяжкими последствиями',
            'variable_name': 'L13 (Количество ДТП с тяжкими последствиями)',
        },
    }