# Данные о переменных
class Constants:
    VARIABLES_DESCRIPTION = {
        '1': {
            'variable_title': 'X1 эффективность функционирования хранилища данных',
            'variable_name': 'X1 (эффективность функционирования хранилища данных)',
        },
        '2': {
            'variable_title': 'X2 качество программного обеспечения (ПО)',
            'variable_name': 'X2 (качество программного обеспечения (ПО))',
        },
        '3': {
            'variable_title': 'X3 корректность ПО',
            'variable_name': 'X3 (корректность ПО)',
        },
        '4': {
            'variable_title': '\n\nX4 надежность программного обеспечения',
            'variable_name': 'X4 (надежность программного обеспечения)',
        },
        '5': {
            'variable_title': 'X5 доступность программного обеспечения',
            'variable_name': 'X5 (доступность программного обеспечения)',
        },
        '6': {
            'variable_title': 'X6 возможность интенсивного использования ПО',
            'variable_name': 'X6 (возможность интенсивного использования ПО)',
        },
        '7': {
            'variable_title': 'X7 прослеживаемость ПО',
            'variable_name': 'X7 (прослеживаемость ПО)',
        },
        '8': {
            'variable_title': 'X8 функциональная полнота ПО',
            'variable_name': 'X8 (функциональная полнота ПО)',
        },
        '9': {
            'variable_title': 'X9 обеспечение требуемой последовательности работ при проектировании хранилища',
            'variable_name': 'X9 (обеспечение требуемой последовательности работ при проектировании хранилища)',
        },
        '10': {
            'variable_title': 'X10 практичность ПО',
            'variable_name': 'X10 (практичность ПО)',
        },
        '11': {
            'variable_title': 'X11 устойчивость к ошибкам данных программного обеспечения',
            'variable_name': 'X11 (устойчивость к ошибкам данных программного обеспечения)',
        },
        '12': {
            'variable_title': '\n\nX12 эффективность выполнения транзакций',
            'variable_name': 'X12 (эффективность выполнения транзакций)',
        },
        '13': {
            'variable_title': 'X13 степень мотивации персонала, осуществляющего эксплуатацию хранилища данных',
            'variable_name': 'X13 (степень мотивации персонала, осуществляющего эксплуатацию хранилища данных)',
        },
        '14': {
            'variable_title': 'X14 удобство тестирования ПО',
            'variable_name': 'X14 (удобство тестирования ПО)',
        },
    }