# Данные о переменных
class Constants:
    VARIABLES_DESCRIPTION = {
        '1': {
            'variable_title': 'L1 эффективность функционирования хранилища данных',
            'variable_name': 'L1 (эффективность функционирования хранилища данных)',
        },
        '2': {
            'variable_title': 'L2 качество программного обеспечения (ПО)',
            'variable_name': 'L2 (качество программного обеспечения (ПО))',
        },
        '3': {
            'variable_title': 'L3 корректность ПО',
            'variable_name': 'L3 (корректность ПО)',
        },
        '4': {
            'variable_title': '\n\nL4 надежность программного обеспечения',
            'variable_name': 'L4 (надежность программного обеспечения)',
        },
        '5': {
            'variable_title': 'L5 доступность программного обеспечения',
            'variable_name': 'L5 (доступность программного обеспечения)',
        },
        '6': {
            'variable_title': 'L6 возможность интенсивного использования ПО',
            'variable_name': 'L6 (возможность интенсивного использования ПО)',
        },
        '7': {
            'variable_title': 'L7 прослеживаемость ПО',
            'variable_name': 'L7 (прослеживаемость ПО)',
        },
        '8': {
            'variable_title': 'L8 функциональная полнота ПО',
            'variable_name': 'L8 (функциональная полнота ПО)',
        },
        '9': {
            'variable_title': 'L9 обеспечение требуемой последовательности работ при проектировании хранилища',
            'variable_name': 'L9 (обеспечение требуемой последовательности работ при проектировании хранилища)',
        },
        '10': {
            'variable_title': 'L10 практичность ПО',
            'variable_name': 'L10 (практичность ПО)',
        },
        '11': {
            'variable_title': 'L11 устойчивость к ошибкам данных программного обеспечения',
            'variable_name': 'L11 (устойчивость к ошибкам данных программного обеспечения)',
        },
        '12': {
            'variable_title': '\n\nL12 эффективность выполнения транзакций',
            'variable_name': 'L12 (эффективность выполнения транзакций)',
        },
        '13': {
            'variable_title': 'L13 степень мотивации персонала, осуществляющего эксплуатацию хранилища данных',
            'variable_name': 'L13 (степень мотивации персонала, осуществляющего эксплуатацию хранилища данных)',
        },
        '14': {
            'variable_title': 'L14 удобство тестирования ПО',
            'variable_name': 'L14 (удобство тестирования ПО)',
        },
    }