# Данные о переменных
class Constants:
    VARIABLES_DESCRIPTION = {
        '1': {
            'variable_title': 'X1 Общее количество ДТП в РФ (в год)',
            'variable_name': 'X1 (Общее количество ДТП в РФ (в год))',
        },
        '2': {
            'variable_title': 'X2 Количество погибших в ДТП',
            'variable_name': 'X2 (Количество погибших в ДТП)',
        },
        '3': {
            'variable_title': 'X3 Количество раненых в ДТП',
            'variable_name': 'X3 (Количество раненых в ДТП)',
        },
        '4': {
            'variable_title': 'X4 Тяжесть последствий ДТП (кол-во погибших на 100 пострадавших)',
            'variable_name': 'X4 (Тяжесть последствий ДТП (кол-во погибших на 100 пострадавших))',
        },
        '5': {
            'variable_title': 'X5 Количество погибших на 10 000 транспортных средств',
            'variable_name': 'X5 (Количество погибших на 10 000 транспортных средств)',
        },
        '6': {
            'variable_title': 'X6 Количество пострадавших на 100000 жителей',
            'variable_name': 'X6 (Количество пострадавших на 100000 жителей)',
        },
        '7': {
            'variable_title': 'X7 Количество ДТП из-за нарушения ПДД водителями',
            'variable_name': 'X7 (Количество ДТП из-за нарушения ПДД водителями)',
        },
        '8': {
            'variable_title': 'X8 Количество ДТП по вине нетрезвых водителей',
            'variable_name': 'X8 (Количество ДТП по вине нетрезвых водителей)',
        },
        '9': {
            'variable_title': 'X9 Количество ДТП по вине пешеходов',
            'variable_name': 'X9 (Количество ДТП по вине пешеходов)',
        },
        '10': {
            'variable_title': 'X10 Количество ДТП с участием детей',
            'variable_name': 'X10 (Количество ДТП с участием детей)',
        },
        '11': {
            'variable_title': 'X11 Количество ДТП по вине технически неисправных транспортных средств',
            'variable_name': 'X11 (Количество ДТП по вине технически неисправных транспортных средств)',
        },
        '12': {
            'variable_title': 'X12 Количество ДТП из-за неудовлетворительного состояния улиц и дорог',
            'variable_name': 'X12 (Количество ДТП из-за неудовлетворительного состояния улиц и дорог)',
        },
        '13': {
            'variable_title': 'X13 Количество ДТП с тяжкими последствиями',
            'variable_name': 'X13 (Количество ДТП с тяжкими последствиями)',
        },
    }