# Данные о переменных
class Constants:
    VARIABLES_DESCRIPTION = {
        '1': {
            'variable_title': 'L1 Летальность',
            'variable_name': 'L1 (Летальность)',
        },
        '2': {
            'variable_title': 'L2 Численность инфицированных',
            'variable_name': 'L2 (Численность инфицированных)',
        },
        '3': {
            'variable_title': 'L3 Численность цивилизации',
            'variable_name': 'L3 (Численность цивилизации)',
        },
        '4': {
            'variable_title': 'L4 Численность госпитализированных',
            'variable_name': 'L4 (Численность госпитализированных)',
        },
        '5': {
            'variable_title': 'L5 Изолированность',
            'variable_name': 'L5 (Изолированность)',
        },
        '6': {
            'variable_title': 'L6 Скорость распространения',
            'variable_name': 'L6 (Скорость распространения)',
        },
        '7': {
            'variable_title': 'L7 Доступность лекарств',
            'variable_name': 'L7 (Доступность лекарств)',
        },
        '8': {
            'variable_title': 'L8 Доступность лекарств',
            'variable_name': 'L8 (Доступность лекарств)',
        },
        '9': {
            'variable_title': 'L9 Количество умерших от заболевания',
            'variable_name': 'L9 (Количество умерших от заболевания)',
        },
        '10': {
            'variable_title': 'L10 Уровень медицины',
            'variable_name': 'L10 (Уровень медицины)',
        },
        '11': {
            'variable_title': 'L11 Уровень медицины',
            'variable_name': 'L11 (Уровень медицины)',
        },
        '12': {
            'variable_title': 'L12 Длительность периода полного развития болезни',
            'variable_name': 'L12 (Длительность периода полного развития болезни)',
        },
        '13': {
            'variable_title': 'L13 Длительность реабилитационного периода',
            'variable_name': 'L13 (Длительность реабилитационного периода)',
        },
        '14': {
            'variable_title': 'L14 Устойчивость вируса к лекарствам',
            'variable_name': 'L14 (Устойчивость вируса к лекарствам)',
        },
        '15': {
            'variable_title': 'L15 Степень осложнений заболевания',
            'variable_name': 'L15 (Степень осложнений заболевания)',
        }
    }